----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           3,136
       BatchNorm2d-2         [-1, 64, 112, 112]             128
              ReLU-3         [-1, 64, 112, 112]               0
         MaxPool2d-4           [-1, 64, 56, 56]               0
            Conv2d-5          [-1, 128, 56, 56]           8,192
       BatchNorm2d-6          [-1, 128, 56, 56]             256
              ReLU-7          [-1, 128, 56, 56]               0
            Conv2d-8          [-1, 128, 56, 56]           4,608
       BatchNorm2d-9          [-1, 128, 56, 56]             256
             ReLU-10          [-1, 128, 56, 56]               0
           Conv2d-11          [-1, 256, 56, 56]          32,768
      BatchNorm2d-12          [-1, 256, 56, 56]             512
           Linear-13                   [-1, 16]           4,112
             ReLU-14                   [-1, 16]               0
           Linear-15                  [-1, 256]           4,352
           Linear-16                   [-1, 16]           4,112
             ReLU-17                   [-1, 16]               0
           Linear-18                  [-1, 256]           4,352
 ChannelAttention-19            [-1, 256, 1, 1]               0
           Conv2d-20            [-1, 1, 56, 56]              98
 SpatialAttention-21            [-1, 1, 56, 56]               0
             CBAM-22          [-1, 256, 56, 56]               0
           Conv2d-23          [-1, 256, 56, 56]          16,384
      BatchNorm2d-24          [-1, 256, 56, 56]             512
             ReLU-25          [-1, 256, 56, 56]               0
ResNeXtBottleneck-26          [-1, 256, 56, 56]               0
           Conv2d-27          [-1, 128, 56, 56]          32,768
      BatchNorm2d-28          [-1, 128, 56, 56]             256
             ReLU-29          [-1, 128, 56, 56]               0
           Conv2d-30          [-1, 128, 56, 56]           4,608
      BatchNorm2d-31          [-1, 128, 56, 56]             256
             ReLU-32          [-1, 128, 56, 56]               0
           Conv2d-33          [-1, 256, 56, 56]          32,768
      BatchNorm2d-34          [-1, 256, 56, 56]             512
           Linear-35                   [-1, 16]           4,112
             ReLU-36                   [-1, 16]               0
           Linear-37                  [-1, 256]           4,352
           Linear-38                   [-1, 16]           4,112
             ReLU-39                   [-1, 16]               0
           Linear-40                  [-1, 256]           4,352
 ChannelAttention-41            [-1, 256, 1, 1]               0
           Conv2d-42            [-1, 1, 56, 56]              98
 SpatialAttention-43            [-1, 1, 56, 56]               0
             CBAM-44          [-1, 256, 56, 56]               0
             ReLU-45          [-1, 256, 56, 56]               0
ResNeXtBottleneck-46          [-1, 256, 56, 56]               0
           Conv2d-47          [-1, 128, 56, 56]          32,768
      BatchNorm2d-48          [-1, 128, 56, 56]             256
             ReLU-49          [-1, 128, 56, 56]               0
           Conv2d-50          [-1, 128, 56, 56]           4,608
      BatchNorm2d-51          [-1, 128, 56, 56]             256
             ReLU-52          [-1, 128, 56, 56]               0
           Conv2d-53          [-1, 256, 56, 56]          32,768
      BatchNorm2d-54          [-1, 256, 56, 56]             512
           Linear-55                   [-1, 16]           4,112
             ReLU-56                   [-1, 16]               0
           Linear-57                  [-1, 256]           4,352
           Linear-58                   [-1, 16]           4,112
             ReLU-59                   [-1, 16]               0
           Linear-60                  [-1, 256]           4,352
 ChannelAttention-61            [-1, 256, 1, 1]               0
           Conv2d-62            [-1, 1, 56, 56]              98
 SpatialAttention-63            [-1, 1, 56, 56]               0
             CBAM-64          [-1, 256, 56, 56]               0
             ReLU-65          [-1, 256, 56, 56]               0
ResNeXtBottleneck-66          [-1, 256, 56, 56]               0
           Conv2d-67          [-1, 256, 56, 56]          65,536
      BatchNorm2d-68          [-1, 256, 56, 56]             512
             ReLU-69          [-1, 256, 56, 56]               0
           Conv2d-70          [-1, 256, 28, 28]          18,432
      BatchNorm2d-71          [-1, 256, 28, 28]             512
             ReLU-72          [-1, 256, 28, 28]               0
           Conv2d-73          [-1, 512, 28, 28]         131,072
      BatchNorm2d-74          [-1, 512, 28, 28]           1,024
           Linear-75                   [-1, 32]          16,416
             ReLU-76                   [-1, 32]               0
           Linear-77                  [-1, 512]          16,896
           Linear-78                   [-1, 32]          16,416
             ReLU-79                   [-1, 32]               0
           Linear-80                  [-1, 512]          16,896
 ChannelAttention-81            [-1, 512, 1, 1]               0
           Conv2d-82            [-1, 1, 28, 28]              98
 SpatialAttention-83            [-1, 1, 28, 28]               0
             CBAM-84          [-1, 512, 28, 28]               0
           Conv2d-85          [-1, 512, 28, 28]         131,072
      BatchNorm2d-86          [-1, 512, 28, 28]           1,024
             ReLU-87          [-1, 512, 28, 28]               0
ResNeXtBottleneck-88          [-1, 512, 28, 28]               0
           Conv2d-89          [-1, 256, 28, 28]         131,072
      BatchNorm2d-90          [-1, 256, 28, 28]             512
             ReLU-91          [-1, 256, 28, 28]               0
           Conv2d-92          [-1, 256, 28, 28]          18,432
      BatchNorm2d-93          [-1, 256, 28, 28]             512
             ReLU-94          [-1, 256, 28, 28]               0
           Conv2d-95          [-1, 512, 28, 28]         131,072
      BatchNorm2d-96          [-1, 512, 28, 28]           1,024
           Linear-97                   [-1, 32]          16,416
             ReLU-98                   [-1, 32]               0
           Linear-99                  [-1, 512]          16,896
          Linear-100                   [-1, 32]          16,416
            ReLU-101                   [-1, 32]               0
          Linear-102                  [-1, 512]          16,896
ChannelAttention-103            [-1, 512, 1, 1]               0
          Conv2d-104            [-1, 1, 28, 28]              98
SpatialAttention-105            [-1, 1, 28, 28]               0
            CBAM-106          [-1, 512, 28, 28]               0
            ReLU-107          [-1, 512, 28, 28]               0
ResNeXtBottleneck-108          [-1, 512, 28, 28]               0
          Conv2d-109          [-1, 256, 28, 28]         131,072
     BatchNorm2d-110          [-1, 256, 28, 28]             512
            ReLU-111          [-1, 256, 28, 28]               0
          Conv2d-112          [-1, 256, 28, 28]          18,432
     BatchNorm2d-113          [-1, 256, 28, 28]             512
            ReLU-114          [-1, 256, 28, 28]               0
          Conv2d-115          [-1, 512, 28, 28]         131,072
     BatchNorm2d-116          [-1, 512, 28, 28]           1,024
          Linear-117                   [-1, 32]          16,416
            ReLU-118                   [-1, 32]               0
          Linear-119                  [-1, 512]          16,896
          Linear-120                   [-1, 32]          16,416
            ReLU-121                   [-1, 32]               0
          Linear-122                  [-1, 512]          16,896
ChannelAttention-123            [-1, 512, 1, 1]               0
          Conv2d-124            [-1, 1, 28, 28]              98
SpatialAttention-125            [-1, 1, 28, 28]               0
            CBAM-126          [-1, 512, 28, 28]               0
            ReLU-127          [-1, 512, 28, 28]               0
ResNeXtBottleneck-128          [-1, 512, 28, 28]               0
          Conv2d-129          [-1, 256, 28, 28]         131,072
     BatchNorm2d-130          [-1, 256, 28, 28]             512
            ReLU-131          [-1, 256, 28, 28]               0
          Conv2d-132          [-1, 256, 28, 28]          18,432
     BatchNorm2d-133          [-1, 256, 28, 28]             512
            ReLU-134          [-1, 256, 28, 28]               0
          Conv2d-135          [-1, 512, 28, 28]         131,072
     BatchNorm2d-136          [-1, 512, 28, 28]           1,024
          Linear-137                   [-1, 32]          16,416
            ReLU-138                   [-1, 32]               0
          Linear-139                  [-1, 512]          16,896
          Linear-140                   [-1, 32]          16,416
            ReLU-141                   [-1, 32]               0
          Linear-142                  [-1, 512]          16,896
ChannelAttention-143            [-1, 512, 1, 1]               0
          Conv2d-144            [-1, 1, 28, 28]              98
SpatialAttention-145            [-1, 1, 28, 28]               0
            CBAM-146          [-1, 512, 28, 28]               0
            ReLU-147          [-1, 512, 28, 28]               0
ResNeXtBottleneck-148          [-1, 512, 28, 28]               0
          Conv2d-149          [-1, 512, 28, 28]         262,144
     BatchNorm2d-150          [-1, 512, 28, 28]           1,024
            ReLU-151          [-1, 512, 28, 28]               0
          Conv2d-152          [-1, 512, 14, 14]          73,728
     BatchNorm2d-153          [-1, 512, 14, 14]           1,024
            ReLU-154          [-1, 512, 14, 14]               0
          Conv2d-155         [-1, 1024, 14, 14]         524,288
     BatchNorm2d-156         [-1, 1024, 14, 14]           2,048
          Linear-157                   [-1, 64]          65,600
            ReLU-158                   [-1, 64]               0
          Linear-159                 [-1, 1024]          66,560
          Linear-160                   [-1, 64]          65,600
            ReLU-161                   [-1, 64]               0
          Linear-162                 [-1, 1024]          66,560
ChannelAttention-163           [-1, 1024, 1, 1]               0
          Conv2d-164            [-1, 1, 14, 14]              98
SpatialAttention-165            [-1, 1, 14, 14]               0
            CBAM-166         [-1, 1024, 14, 14]               0
          Conv2d-167         [-1, 1024, 14, 14]         524,288
     BatchNorm2d-168         [-1, 1024, 14, 14]           2,048
            ReLU-169         [-1, 1024, 14, 14]               0
ResNeXtBottleneck-170         [-1, 1024, 14, 14]               0
          Conv2d-171          [-1, 512, 14, 14]         524,288
     BatchNorm2d-172          [-1, 512, 14, 14]           1,024
            ReLU-173          [-1, 512, 14, 14]               0
          Conv2d-174          [-1, 512, 14, 14]          73,728
     BatchNorm2d-175          [-1, 512, 14, 14]           1,024
            ReLU-176          [-1, 512, 14, 14]               0
          Conv2d-177         [-1, 1024, 14, 14]         524,288
     BatchNorm2d-178         [-1, 1024, 14, 14]           2,048
          Linear-179                   [-1, 64]          65,600
            ReLU-180                   [-1, 64]               0
          Linear-181                 [-1, 1024]          66,560
          Linear-182                   [-1, 64]          65,600
            ReLU-183                   [-1, 64]               0
          Linear-184                 [-1, 1024]          66,560
ChannelAttention-185           [-1, 1024, 1, 1]               0
          Conv2d-186            [-1, 1, 14, 14]              98
SpatialAttention-187            [-1, 1, 14, 14]               0
            CBAM-188         [-1, 1024, 14, 14]               0
            ReLU-189         [-1, 1024, 14, 14]               0
ResNeXtBottleneck-190         [-1, 1024, 14, 14]               0
          Conv2d-191          [-1, 512, 14, 14]         524,288
     BatchNorm2d-192          [-1, 512, 14, 14]           1,024
            ReLU-193          [-1, 512, 14, 14]               0
          Conv2d-194          [-1, 512, 14, 14]          73,728
     BatchNorm2d-195          [-1, 512, 14, 14]           1,024
            ReLU-196          [-1, 512, 14, 14]               0
          Conv2d-197         [-1, 1024, 14, 14]         524,288
     BatchNorm2d-198         [-1, 1024, 14, 14]           2,048
          Linear-199                   [-1, 64]          65,600
            ReLU-200                   [-1, 64]               0
          Linear-201                 [-1, 1024]          66,560
          Linear-202                   [-1, 64]          65,600
            ReLU-203                   [-1, 64]               0
          Linear-204                 [-1, 1024]          66,560
ChannelAttention-205           [-1, 1024, 1, 1]               0
          Conv2d-206            [-1, 1, 14, 14]              98
SpatialAttention-207            [-1, 1, 14, 14]               0
            CBAM-208         [-1, 1024, 14, 14]               0
            ReLU-209         [-1, 1024, 14, 14]               0
ResNeXtBottleneck-210         [-1, 1024, 14, 14]               0
          Conv2d-211          [-1, 512, 14, 14]         524,288
     BatchNorm2d-212          [-1, 512, 14, 14]           1,024
            ReLU-213          [-1, 512, 14, 14]               0
          Conv2d-214          [-1, 512, 14, 14]          73,728
     BatchNorm2d-215          [-1, 512, 14, 14]           1,024
            ReLU-216          [-1, 512, 14, 14]               0
          Conv2d-217         [-1, 1024, 14, 14]         524,288
     BatchNorm2d-218         [-1, 1024, 14, 14]           2,048
          Linear-219                   [-1, 64]          65,600
            ReLU-220                   [-1, 64]               0
          Linear-221                 [-1, 1024]          66,560
          Linear-222                   [-1, 64]          65,600
            ReLU-223                   [-1, 64]               0
          Linear-224                 [-1, 1024]          66,560
ChannelAttention-225           [-1, 1024, 1, 1]               0
          Conv2d-226            [-1, 1, 14, 14]              98
SpatialAttention-227            [-1, 1, 14, 14]               0
            CBAM-228         [-1, 1024, 14, 14]               0
            ReLU-229         [-1, 1024, 14, 14]               0
ResNeXtBottleneck-230         [-1, 1024, 14, 14]               0
          Conv2d-231          [-1, 512, 14, 14]         524,288
     BatchNorm2d-232          [-1, 512, 14, 14]           1,024
            ReLU-233          [-1, 512, 14, 14]               0
          Conv2d-234          [-1, 512, 14, 14]          73,728
     BatchNorm2d-235          [-1, 512, 14, 14]           1,024
            ReLU-236          [-1, 512, 14, 14]               0
          Conv2d-237         [-1, 1024, 14, 14]         524,288
     BatchNorm2d-238         [-1, 1024, 14, 14]           2,048
          Linear-239                   [-1, 64]          65,600
            ReLU-240                   [-1, 64]               0
          Linear-241                 [-1, 1024]          66,560
          Linear-242                   [-1, 64]          65,600
            ReLU-243                   [-1, 64]               0
          Linear-244                 [-1, 1024]          66,560
ChannelAttention-245           [-1, 1024, 1, 1]               0
          Conv2d-246            [-1, 1, 14, 14]              98
SpatialAttention-247            [-1, 1, 14, 14]               0
            CBAM-248         [-1, 1024, 14, 14]               0
            ReLU-249         [-1, 1024, 14, 14]               0
ResNeXtBottleneck-250         [-1, 1024, 14, 14]               0
          Conv2d-251          [-1, 512, 14, 14]         524,288
     BatchNorm2d-252          [-1, 512, 14, 14]           1,024
            ReLU-253          [-1, 512, 14, 14]               0
          Conv2d-254          [-1, 512, 14, 14]          73,728
     BatchNorm2d-255          [-1, 512, 14, 14]           1,024
            ReLU-256          [-1, 512, 14, 14]               0
          Conv2d-257         [-1, 1024, 14, 14]         524,288
     BatchNorm2d-258         [-1, 1024, 14, 14]           2,048
          Linear-259                   [-1, 64]          65,600
            ReLU-260                   [-1, 64]               0
          Linear-261                 [-1, 1024]          66,560
          Linear-262                   [-1, 64]          65,600
            ReLU-263                   [-1, 64]               0
          Linear-264                 [-1, 1024]          66,560
ChannelAttention-265           [-1, 1024, 1, 1]               0
          Conv2d-266            [-1, 1, 14, 14]              98
SpatialAttention-267            [-1, 1, 14, 14]               0
            CBAM-268         [-1, 1024, 14, 14]               0
            ReLU-269         [-1, 1024, 14, 14]               0
ResNeXtBottleneck-270         [-1, 1024, 14, 14]               0
          Conv2d-271         [-1, 1024, 14, 14]       1,048,576
     BatchNorm2d-272         [-1, 1024, 14, 14]           2,048
            ReLU-273         [-1, 1024, 14, 14]               0
          Conv2d-274           [-1, 1024, 7, 7]         294,912
     BatchNorm2d-275           [-1, 1024, 7, 7]           2,048
            ReLU-276           [-1, 1024, 7, 7]               0
          Conv2d-277           [-1, 2048, 7, 7]       2,097,152
     BatchNorm2d-278           [-1, 2048, 7, 7]           4,096
          Linear-279                  [-1, 128]         262,272
            ReLU-280                  [-1, 128]               0
          Linear-281                 [-1, 2048]         264,192
          Linear-282                  [-1, 128]         262,272
            ReLU-283                  [-1, 128]               0
          Linear-284                 [-1, 2048]         264,192
ChannelAttention-285           [-1, 2048, 1, 1]               0
          Conv2d-286              [-1, 1, 7, 7]              98
SpatialAttention-287              [-1, 1, 7, 7]               0
            CBAM-288           [-1, 2048, 7, 7]               0
          Conv2d-289           [-1, 2048, 7, 7]       2,097,152
     BatchNorm2d-290           [-1, 2048, 7, 7]           4,096
            ReLU-291           [-1, 2048, 7, 7]               0
ResNeXtBottleneck-292           [-1, 2048, 7, 7]               0
          Conv2d-293           [-1, 1024, 7, 7]       2,097,152
     BatchNorm2d-294           [-1, 1024, 7, 7]           2,048
            ReLU-295           [-1, 1024, 7, 7]               0
          Conv2d-296           [-1, 1024, 7, 7]         294,912
     BatchNorm2d-297           [-1, 1024, 7, 7]           2,048
            ReLU-298           [-1, 1024, 7, 7]               0
          Conv2d-299           [-1, 2048, 7, 7]       2,097,152
     BatchNorm2d-300           [-1, 2048, 7, 7]           4,096
          Linear-301                  [-1, 128]         262,272
            ReLU-302                  [-1, 128]               0
          Linear-303                 [-1, 2048]         264,192
          Linear-304                  [-1, 128]         262,272
            ReLU-305                  [-1, 128]               0
          Linear-306                 [-1, 2048]         264,192
ChannelAttention-307           [-1, 2048, 1, 1]               0
          Conv2d-308              [-1, 1, 7, 7]              98
SpatialAttention-309              [-1, 1, 7, 7]               0
            CBAM-310           [-1, 2048, 7, 7]               0
            ReLU-311           [-1, 2048, 7, 7]               0
ResNeXtBottleneck-312           [-1, 2048, 7, 7]               0
          Conv2d-313           [-1, 1024, 7, 7]       2,097,152
     BatchNorm2d-314           [-1, 1024, 7, 7]           2,048
            ReLU-315           [-1, 1024, 7, 7]               0
          Conv2d-316           [-1, 1024, 7, 7]         294,912
     BatchNorm2d-317           [-1, 1024, 7, 7]           2,048
            ReLU-318           [-1, 1024, 7, 7]               0
          Conv2d-319           [-1, 2048, 7, 7]       2,097,152
     BatchNorm2d-320           [-1, 2048, 7, 7]           4,096
          Linear-321                  [-1, 128]         262,272
            ReLU-322                  [-1, 128]               0
          Linear-323                 [-1, 2048]         264,192
          Linear-324                  [-1, 128]         262,272
            ReLU-325                  [-1, 128]               0
          Linear-326                 [-1, 2048]         264,192
ChannelAttention-327           [-1, 2048, 1, 1]               0
          Conv2d-328              [-1, 1, 7, 7]              98
SpatialAttention-329              [-1, 1, 7, 7]               0
            CBAM-330           [-1, 2048, 7, 7]               0
            ReLU-331           [-1, 2048, 7, 7]               0
ResNeXtBottleneck-332           [-1, 2048, 7, 7]               0
AdaptiveAvgPool2d-333           [-1, 2048, 1, 1]               0
         Dropout-334                 [-1, 2048]               0
          Linear-335                    [-1, 7]          14,343
================================================================
Total params: 28,051,527
Trainable params: 28,051,527
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.19
Forward/backward pass size (MB): 404.48
Params size (MB): 107.01
Estimated Total Size (MB): 511.68
----------------------------------------------------------------
